Repository: IvanPohorielov/SenseTag
Catalog: SenseTag/SenseTag/Resources/Localizable.xcstrings
Source language: en
Languages: ru, uk

# common.cancel
source: Cancel
ru: Отмена
uk: Скасувати

# common.closeButton.hint
source: Tap twice to close the screen
ru: Нажмите дважды, чтобы закрыть экран
uk: Натисніть двічі, щоб закрити екран

# common.closeButton.label
source: Close screen
ru: Закрыть экран
uk: Закрити екран

# common.closeKeyboardButton.hint
source: Close keyboard
ru: Закрыть клавиатуру
uk: Закрити клавіатуру

# common.closeKeyboardButton.label
source: Tap twice to close keyboard
ru: Нажмите дважды, чтобы закрыть клавиатуру
uk: Натисніть двічі, щоб закрити клавіатуру

# common.copyButton.hint
source: Tap twice to copy text to clipboard
ru: Нажмите дважды, чтобы скопировать текст в буфер обмена
uk: Натисніть двічі, щоб скопіювати текст в буфер обміну

# common.copyButton.label
source: Copy text
ru: Скопировать текст
uk: Скопіювати текст

# common.linkButton.hint
source: Tap twice to open URL
ru: Нажмите дважды, чтобы открыть ссылку
uk: Натисніть двічі, щоб відкрити посилання

# common.linkButton.label
source: Open URL
ru: Открыть ссылку
uk: Відкрити посилання

# common.progressView.title
source: Loading…
ru: Загрузка…
uk: Завантаження…

# common.saveButton.hint
source: Tap twice to write data to tag
ru: Нажмите дважды, чтобы записать данные на метку
uk: Натисніть двічі, щоб записати данні на мітку

# mainScreen.alert.action.confirm
source: Confirm
ru: Подтвердить
uk: Підтвердити

# mainScreen.alert.error.title
source: An error occurred
ru: Произошла ошибка
uk: Сталась помилка

# mainScreen.alert.error.tryAgain
source: Try again
ru: Повторить
uk: Спробувати знову

# mainScreen.alert.message.clearTag
source: Clear action cannot be undone. Are you sure?
ru: Действие очистки нельзя отменить. Вы уверены?
uk: Дію очищення не можна скасувати. Ви впевнені?

# mainScreen.alert.message.lockTag
source: Lock action cannot be undone. Are you sure?
ru: Действие блокировки нельзя отменить. Вы уверены?
uk: Дію блокування не можна скасувати. Ви впевнені?

# mainScreen.alert.title.clearTag
source: Clear tag?
ru: Очистить метку?
uk: Очистити мітку?

# mainScreen.alert.title.lockTag
source: Lock tag?
ru: Заблокировать метку?
uk: Заблокувати мітку?

# mainScreen.dialog.action.clearTag
source: Clear Tag
ru: Очистить метку
uk: Очистити мітку

# mainScreen.dialog.action.lockTag
source: Lock Tag
ru: Заблокировать метку
uk: Заблокувати мітку

# mainScreen.dialog.otherActions
source: Other actions
ru: Другие действия
uk: Інші дії

# mainScreen.tile.other
source: Other
ru: Другое
uk: Інше

# mainScreen.tile.other.hint
source: Tap twice to open the tag lock and clear functions.
ru: Нажмите дважды, чтобы открыть блокировку и очистку метки.
uk: Натисніть двічі, щоб відкрити функції блокування і очищення мітки.

# mainScreen.tile.read
source: Read Tag
ru: Сканировать метку
uk: Сканувати мітку

# mainScreen.tile.read.hint
source: Tap twice to start scanning the tag.
ru: Нажмите дважды, чтобы начала сканирования метки.
uk: Натисніть двічі, щоб почати сканування мітки.

# mainScreen.tile.write
source: Create Tag
ru: Создать метку
uk: Створити мітку

# mainScreen.tile.write.hint
source: Tap twice to start creating a tag.
ru: Нажмите дважды, чтобы начать создание метки.
uk: Натисніть двічі, щоб почати створення мітки.

# readTagSheet.empty.label
source: The tag contains no data
ru: Метка не содержит данных
uk: Мітка не містить данних

# readTagSheet.empty.title
source: The tag is empty.
ru: Метка пустая.
uk: Мітка пуста.

# readTagSheet.navigationTitle
source: Scanned tag
ru: Сканированная метка
uk: Сканована мітка

# readTagSheet.recordItem.contentView.empty.hint
source: This record contains no data.
ru: Эта запись не содержит данных.
uk: Цей запис не містить даних.

# readTagSheet.recordItem.contentView.empty.label
source: Empty record
ru: Пустая запись
uk: Пустий запис

# readTagSheet.recordItem.contentView.other.hint
source: This record has an unknown data format.
ru: Запись имеет неизвестный формат данных.
uk: Цей запис має невідомий формат даних.

# readTagSheet.recordItem.contentView.other.label
source: Unknown entry
ru: Неизвестная запись
uk: Невідомий запис

# readTagSheet.recordItem.contentView.text.label %@
source: Text entry: %@
ru: Текстовая запись: %@
uk: Текстовий запис: %@

# readTagSheet.recordItem.empty
source: Empty payload
ru: Пустая запись
uk: Пустий запис

# readTagSheet.recordItem.record %lld
source: Record #%lld
ru: Запись #%lld
uk: Запис #%lld

# readTagSheet.recordItem.unknown
source: Unknown payload
ru: Неизвестный формат данных
uk: Невідомий формат даних

# writeTagSheet.error.action
source: Try again
ru: Попробовать снова
uk: Спробувати знову

# writeTagSheet.error.action.hint
source: Tap twice to try write tag
ru: Нажмите дважды, чтобы попробовать записать метку
uk: Натисніть двічі, щоб спробувати записати мітку

# writeTagSheet.error.title
source: An error occurred
ru: Произошла ошибка
uk: Сталась помилка

# writeTagSheet.navigationTitle
source: Create Tag
ru: Создать метку
uk: Створити мітку

# writeTagSheet.picker.hint
source: Tap twice to select payload type
ru: Нажмите дважды, чтобы выбрать тип данных
uk: Натисніть двічі, щоб вибрати тип данних

# writeTagSheet.picker.title
source: Payload type
ru: Тип данных
uk: Тип данних

# writeTagSheet.saveButton.title
source: Write
ru: Записать
uk: Записати

# writeTagSheet.textEditor.caption %lld
source: Bytes: %lld
ru: Байты: %lld
uk: Байти: %lld

# writeTagSheet.textEditor.placeholder.text
source: Enter text
ru: Введите текст
uk: Введіть текст

# writeTagSheet.textEditor.placeholder.url
source: Enter URL
ru: Введите ссылку
uk: Введіть посилання
